#+HUGO_BASE_DIR: ../../
#+EXPORT_HUGO_CATEGORIES: elisp, denote, org-mode
#+DATE: <2023-11-30 Thu>
#+TITLE: Adding phrack to denote

[[https://protesilaos.com/emacs/denote][Denote]] is my new note taking system and I really wanted to add the [[http://www.phrack.org][phrack]] articles to denote so I can search and index them. At time of writing there are 70 articles, and you can download the archives for each one [[http://www.phrack.org/archives/][here]]. But I wanted to automate the whole process, and do it with Emacs lisp.

* Searching
I use [[https://github.com/mclear-tools/consult-notes][consult-notes]] for searching my notes, however, the =consult-notes= command only searches by filename and tags. I want the ability to use a prefix before my =consult-notes= command to then run =consult-notes-search-in-all-notes=. Ideally I want to use the =C-u= prefix, however if you bind something with the =C-u= prefix, your met with a pretty nasty error. For example:

#+begin_src emacs-lisp :noeval
(global-set-key (kbd "C-u C-c n") 'consult-notes-search-in-all-notes)
#+end_src

#+RESULTS:
: global-set-key: Key sequence C-u c starts with non-prefix key C-u

I was able to get around this, but making my own function, and binding =C-c n= to that. This is what the function looks like:

#+begin_src emacs-lisp :results none
  (defun jt/consult-notes-search-in-all-notes ()
    (interactive)
    (if current-prefix-arg
	(consult-notes-search-in-all-notes)
      (consult-notes))))
#+end_src

Now If I were to press =C-c n= it would run =consult-notes= but if I were to prefix that with =C-u= It would run =consult-notes-search-in-all-notes=.

